Repository: 37MobileTeam/iChatGPT
Catalog: iChatGPT/*.lproj/Localizable.strings
Languages: ru

source: Loading..
ru: Загрузка..

source: Just ask..
ru: Просто спросите..

source: Re-question
ru: Переформулировать вопрос

source: Copy Question
ru: Копировать вопрос

source: Copy Answer
ru: Копировать ответ

source: Copy Question and Answer
ru: Копировать вопрос и ответ

source: Copy Question to Inputbox
ru: Скопировать вопрос в поле ввода

source: Delete Question
ru: Удалить вопрос

source: Delete All
ru: Удалить все

source: Settings
ru: Настройки

source: Please enter OpenAI Key
ru: Пожалуйста, введите ключ API

source: OpenAI Key cannot be empty
ru: Ключ API не может быть пустым

source: Save Key
ru: Сохранить ключ

source: Developer: 37 Mobile iOS Tech Team GitHub: https://github.com/37iOS/iChatGPT
ru: Разработчик: 37 Mobile iOS Tech Team GitHub: https://github.com/37MobileTeam/iChatGPT

source: Open a new conversation
ru: Открыть новый разговор

source: The current chat log will be saved and closed, and a new chat session will be created.
ru: Текущий журнал чата будет сохранен и закрыт, и будет создана новая сессия чата.

source: Create
ru: Создать

source: Re-ask
ru: Переспросить

source: Re-request the last question.
ru: Повторно запросить последний вопрос.

source: OK
ru: ОК

source: Clear current conversation
ru: Очистить текущий разговор

source: Clears the current conversation and deletes the saved conversation history.
ru: Очищает текущий разговор и удаляет сохраненную историю разговоров.

source: Clear
ru: Очистить

source: No conversations
ru: Нет разговоров

source: Delete Chat
ru: Удалить чат

source: Are you sure you want to delete this chat?
ru: Вы уверены, что хотите удалить этот чат?

source: Delete
ru: Удалить

source: Chat History
ru: История чата

source: Coming soon..
ru: Скоро..

source: Room Settings
ru: Настройки комнаты

source: Save
ru: Сохранить

source: Current Chat
ru: Текущий чат

source: Share
ru: Поделиться

source: Choose a sharing format
ru: Выберите формат для обмена

source: Image
ru: Изображение

source: Room Name
ru: Имя комнаты

source: The name of the room
ru: Название чат-комнаты

source: Prompt description.
ru: Попросите ChatGPT играть определенную роль, например, 'Я хочу, чтобы ты играл роль интервьюера xxx.'

source: Prompt text to generate contextual information for the corresponding text.
ru: Текст Prompt для генерации контекстной информации для соответствующего текста.

source: What sampling temperature to use, between 0 and 2. Higher values like 0.8 will make the output more random, while lower values like 0.2 will make it more focused and deterministic.
ru: Какую температуру выборки использовать между 0 и 2. Более высокие значения, такие как 0,8, сделают выходные данные более случайными, а более низкие значения, такие как 0,2, сделают их более сосредоточенными и детерминированными.

source: The default temperature is 0.7
ru: Стандартная Temperature составляет 0.7

source: How much context information is carried when sending a dialog.
ru: Сколько контекстной информации передается при отправке диалога.

source: Default is the last 3 conversations.
ru: По умолчанию это последние 3 разговора.

source: Temperature is between 0 and 2.
ru: Temperature находится между 0 и 2.

source: History message count must be an integer greater than or equal to 0.
ru: Количество исторических сообщений должно быть целым числом, большим или равным 0.

source: Settings have been updated~
ru: Настройки были обновлены~

source: Tips
ru: Советы

source: Select Room API Model
ru: Выберите модель API чата

source: Deafult API Model
ru: Модель по умолчанию для новых чат-комнат

source: For example:
ru: Например:

source: Use Default
ru: Использовать значение по умолчанию

source: Current use Key:
ru: Текущее использование:

source: API Request timeout (seconds)
ru: Таймаут запроса API (секунды)

source: API host format is incorrect!
ru: Формат хоста API неверен!

source: API timeout must be a number
ru: Тайм-аут должен быть числом

source: Chats Streaming
ru: Поток чата диалога

source: Use streaming conversations
ru: Использовать потоковый вывод
